{
  "certificates": {
    "title": "Сертификаты"
  },
  "common": {
    "actions": {
      "download": "Скачать",
      "switchLanguage": "Поменять язык"
    }
  },
  "jobs": {
    "projects[0]": {
      "points[0]": "Прояснял требования заинтересованных сторон",
      "points[1]": "Управлял всеми процессами создания веб-сайта для клиента с нуля",
      "points[2]": "Работал с JavaScript, CSS (а также SCSS, Sass), HTML, WordPress и PHP",
      "role": "Web Developer",
      "title": "Rerise"
    },
    "projects[1]": {
      "points[0]": "Совместно с командой разработал новый платежный метод, используя JavaScript и HTML",
      "points[1]": "Участвовал в определении требований их имплементации, что привело к успешной реализации задуманного функционала",
      "points[2]": "Получил навыки JavaScript через практическое применение и самостоятельное обучение",
      "role": "Frontend Developer",
      "title": "Chitai Gorod"
    },
    "projects[2]": {
      "points[0]": "Разработал внутреннюю админ-панель для крупного российского банка с использованием React и TypeScript, обслуживающую 500+ внутренних пользователей ежедневно",
      "points[1]": "Участвовал в создании мобильного инвестиционного приложения для одного из крупнейших банков России со 10K+ активными пользователями",
      "points[2]": "Реализовал комплексное покрытие unit, e2e и интеграционными тестами (85%+) с использованием Jest и React Testing Library",
      "role": "Frontend Developer",
      "title": "Globus-IT"
    },
    "projects[3]": {
      "points[0]": "Руководил кроссфункциональной командой из 5 разработчиков в международном проекте по обновлению зависимостей и созданию комплексной UI-библиотеки для клиента из Fortune 500",
      "points[1]": "Оптимизировал производительность enterprise-приложения, сократив время первоначальной загрузки с 10 до 2 секунд через внедрение lazy loading, виртуализации табличных данных и оптимизации рендеринга",
      "points[2]": "Спроектировал и разработал улучшения методов оплаты для крупного глобального e-commerce бренда, успешно обрабатывая 1M+ транзакций ежедневно с uptime 99.9%",
      "role": "Senior Frontend Developer / Team Lead",
      "title": "Grid Dynamics"
    },
    "projects[4]": {
      "points[0]": "Проектировал и разрабатывал криптовалютный проект с использованием современного стека: React, Remix, TypeScript, Node.js с акцентом на безопасность и производительность",
      "points[1]": "Выделил компоненты монолитного приложения в микросервисы (BFF и frontend части), повысив масштабируемость системы на 200% и сократив время деплоя",
      "points[2]": "В сотрудничестве с product-менеджерами и backend-командой в Agile-окружении с использованием Jira и Confluence",
      "role": "Senior Frontend Engineer",
      "title": "T1 Innotech"
    },
    "title": "Опыт работы"
  },
  "personal": {
    "address": "Россия, Казань",
    "firstName": "Кирилл",
    "geo": "Весь мир",
    "lastName": "Петунин",
    "position": "Senior Software Engineer",
    "workFormat": "Удаленно"
  },
  "pets": {
    "title": "Pets"
  },
  "profile": {
    "bio": "Senior Frontend Developer с 7+ годами опыта разработки масштабируемых веб-приложений для международных компаний, включая Grid Dynamics и T1 Innotech. Эксперт в React, TypeScript, Node.js и Nest.js с подтвержденным опытом оптимизации производительности (сокращение времени загрузки приложения с 10 до 2 секунд) и проектирования микросервисных архитектур. Успешно руководил кроссфункциональными командами, участвовал в разработке платежных систем для глобальных брендов с обработкой миллионов транзакций ежедневно. Автор open-source библиотеки SnowUI с 50+ компонентами, используемой в production-проектах. Свободное владение английским языком (C1-C2), опыт работы в Agile/Scrum окружении, открыт к удаленному сотрудничеству с компаниями по всему миру.",
    "title": "Профиль"
  },
  "social": {
    "title": "Ссылки"
  },
  "stack": {
    "title": "Технологии"
  }
}